In [3]:
import numpy as np
import pandas as pd

In [4]:
data = pd.Series([1,2,3,4,5,6,7,8,np.nan,9])#here nan is undefined element 
data

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    7.0
7    8.0
8    NaN
9    9.0
dtype: float64

In [5]:
#here it detect the null value
data.isnull()#if value is not defined in the given data the output true or else false

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8     True
9    False
dtype: bool

In [6]:
# it detect non missing values
data.notnull()#if value is defined in the given data the output is true or else false

0     True
1     True
2     True
3     True
4     True
5     True
6     True
7     True
8    False
9     True
dtype: bool

In [7]:
#create a data frame
dict = {
    0:[1,2,3,4,np.nan],
    1:[1,2,3,np.nan,np.nan],
    2:[1,2,np.nan,np.nan,np.nan],
    3:[1,np.nan,np.nan,np.nan,np.nan],
    4:[np.nan,np.nan,np.nan,np.nan,np.nan]
}

df = pd.DataFrame(dict)
df

     0    1    2    3   4
0  1.0  1.0  1.0  1.0 NaN
1  2.0  2.0  2.0  NaN NaN
2  3.0  3.0  NaN  NaN NaN
3  4.0  NaN  NaN  NaN NaN
4  NaN  NaN  NaN  NaN NaN

In [8]:
#drop the entire row if one nan value is present
df.dropna()

Empty DataFrame
Columns: [0, 1, 2, 3, 4]
Index: []

In [9]:
#Delete the row if all values are null
df.dropna(how='all')

     0    1    2    3   4
0  1.0  1.0  1.0  1.0 NaN
1  2.0  2.0  2.0  NaN NaN
2  3.0  3.0  NaN  NaN NaN
3  4.0  NaN  NaN  NaN NaN

In [10]:
#delete the columns if all values are null
df.dropna(axis=1, how='all')

     0    1    2    3
0  1.0  1.0  1.0  1.0
1  2.0  2.0  2.0  NaN
2  3.0  3.0  NaN  NaN
3  4.0  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN

In [11]:
df#here the values are not stored in df variables

     0    1    2    3   4
0  1.0  1.0  1.0  1.0 NaN
1  2.0  2.0  2.0  NaN NaN
2  3.0  3.0  NaN  NaN NaN
3  4.0  NaN  NaN  NaN NaN
4  NaN  NaN  NaN  NaN NaN

df.mean()
.gives the mean values
.to fill the missing values by the mean values we use mean()

In [12]:
df_mean = df.fillna(df.mean())#it prints the mean value in the place of nan value 
df_mean

     0    1    2    3   4
0  1.0  1.0  1.0  1.0 NaN
1  2.0  2.0  2.0  1.0 NaN
2  3.0  3.0  1.5  1.0 NaN
3  4.0  2.0  1.5  1.0 NaN
4  2.5  2.0  1.5  1.0 NaN

Replace(old_value,new_value)
.replaces the old values with new values
.values can be anything.

In [13]:
ser1 = pd.Series([1,2,3,4,50,6,8,100,9])
ser1

0      1
1      2
2      3
3      4
4     50
5      6
6      8
7    100
8      9
dtype: int64

In [14]:
ser1.replace(100,1)#it replace the 1 in the place of 100

0     1
1     2
2     3
3     4
4    50
5     6
6     8
7     1
8     9
dtype: int64

In [15]:
ser1.replace(50,10)

0      1
1      2
2      3
3      4
4     10
5      6
6      8
7    100
8      9
dtype: int64

In [16]:
ser1.replace([50,100,8],25)#to replace the multiple values with one single value

0     1
1     2
2     3
3     4
4    25
5     6
6    25
7    25
8     9
dtype: int64

In [17]:
ser1# it gives the old data because we not stored in any variable

0      1
1      2
2      3
3      4
4     50
5      6
6      8
7    100
8      9
dtype: int64

In [18]:
ser1.replace({50:np.nan,100:50})#to replace diff values with some other diff values

0     1.0
1     2.0
2     3.0
3     4.0
4     NaN
5     6.0
6     8.0
7    50.0
8     9.0
dtype: float64

.To get Dummies
.it is one of the method to convert categorical() variable to numerical variables

In [19]:
ser2 = pd.Series(list('abcdeabcd'))
ser2

0    a
1    b
2    c
3    d
4    e
5    a
6    b
7    c
8    d
dtype: object

In [20]:
pd.get_dummies(ser2)

   a  b  c  d  e
0  1  0  0  0  0
1  0  1  0  0  0
2  0  0  1  0  0
3  0  0  0  1  0
4  0  0  0  0  1
5  1  0  0  0  0
6  0  1  0  0  0
7  0  0  1  0  0
8  0  0  0  1  0